# --------
# Основное
# --------

PREFIX = '$' # Префикс для команд. У каждого бота на сервере должен быть различным
BOT_USER_ID = 861524897239269396 # ID бота

# ------
# Каналы
# ------

COMMANDS_LOG_CHANNEL = 1018510380219256843 # Канал для отправки логов команд
PUNISHMENT_LOG_CHANNEL = 1010131811986329741 # Канал для отправки логов наказаний

# ----
# Роли
# ----

ADMIN_ROLE_ID = 1017707000324427776 # ID роли администратора
DEV_ROLE_ID = 1006205951017242765 # ID роли разработчика
TESTER_ROLE_ID = 995691157583577158 # ID роли, которая будет выдаваться участнику при назначении на тестера
CONTROL_ROLE_ID = 1017707310400933908 # ID роли младшего модератора
SUPPORT_ROLE_ID = 1014947722404573194 # ID роли, которая будет выдаваться участнику при назначении на саппорта
PR_ROLE_ID = 999343775426019438 # ID роли, которая будет выдаваться участнику при назначении на пиарщика
TICKET_ROLE_ID = 1014179052006949034 # ID роли, для управления тикетами
MUTE_ROLE_ID = 1014149596357873794 # ID роли, которая будет выдаваться участнику при муте
BAN_ROLE_ID = 1008634851873792011 # ID роли, которая будет выдаваться участнику при бане
MALE_ROLE_ID = 1014948936718491699 # ID мужской роли, которая будет выдаваться при допуске на сервер
FEMALE_ROLE_ID = 1014948972244250744 # ID женской роли, которая будет выдаваться при допуске на сервер
FAKE_ROLE_ID = 1014950196922290317 # ID роли, которая будет выдаваться фейку при допуске на сервер
EXAM_ROLE_ID = 1014950227461029938 # ID проверочной роли, которая будет сниматься при допуске на сервер

# -------
# Функции
# -------

SEND_PUNISHMENT_PERSONAL_MESSAGE = True # Включение(True)/Отключение(False) отправления личных сообщений участникам при наказаниях, назначениях и их отмене | ЕЩЁ НЕ ПРОПИСАНО
DELETE_COMMANDS = True # Включение(True)/Отключение(False) удаления сообщения с командой перед выводом ответа
COMMANDS_LOG = True # Включение(True)/Отключение(False) логирования команд в одном канале | ЕЩЁ НЕ ПРОПИСАНО

# -----------
# Цвета embed
# -----------

EMBED_COLOUR_ERROR = 0xfed900 # Цвет embed в обработке ошибок
EMBED_COLOUR_SUCCESS = 0xffcb81 # Цвет embed в случае успеха

# ------
# Эмодзи
# ------

ERROR_EMOJI = 1020718406825156648
SUCCESS_EMOJI = 1020716160720838697